{
    "format": "layers-model",
    "generatedBy": "keras v2.4.0",
    "convertedBy": "TensorFlow.js Converter v3.8.0",
    "modelTopology": {
        "keras_version": "2.4.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "model",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                1,
                                null,
                                null
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_0"
                        },
                        "name": "input_0",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "7_pad",
                            "trainable": true,
                            "dtype": "float32",
                            "padding": [
                                [
                                    2,
                                    2
                                ],
                                [
                                    2,
                                    2
                                ]
                            ],
                            "data_format": "channels_first"
                        },
                        "name": "7_pad",
                        "inbound_nodes": [
                            [
                                [
                                    "input_0",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "7",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                5,
                                5
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_first",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "7",
                        "inbound_nodes": [
                            [
                                [
                                    "7_pad",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "8",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "tanh"
                        },
                        "name": "8",
                        "inbound_nodes": [
                            [
                                [
                                    "7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "9_pad",
                            "trainable": true,
                            "dtype": "float32",
                            "padding": [
                                [
                                    1,
                                    1
                                ],
                                [
                                    1,
                                    1
                                ]
                            ],
                            "data_format": "channels_first"
                        },
                        "name": "9_pad",
                        "inbound_nodes": [
                            [
                                [
                                    "8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "9",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_first",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "9",
                        "inbound_nodes": [
                            [
                                [
                                    "9_pad",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "10",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "tanh"
                        },
                        "name": "10",
                        "inbound_nodes": [
                            [
                                [
                                    "9",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "11_pad",
                            "trainable": true,
                            "dtype": "float32",
                            "padding": [
                                [
                                    1,
                                    1
                                ],
                                [
                                    1,
                                    1
                                ]
                            ],
                            "data_format": "channels_first"
                        },
                        "name": "11_pad",
                        "inbound_nodes": [
                            [
                                [
                                    "10",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "11",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 16,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_first",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "11",
                        "inbound_nodes": [
                            [
                                [
                                    "11_pad",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "name": "13",
                            "trainable": true,
                            "dtype": "float32",
                            "target_shape": [
                                1,
                                4,
                                4,
                                64,
                                64
                            ]
                        },
                        "name": "13",
                        "inbound_nodes": [
                            [
                                [
                                    "11",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Permute",
                        "config": {
                            "name": "14",
                            "trainable": true,
                            "dtype": "float32",
                            "dims": [
                                1,
                                4,
                                2,
                                5,
                                3
                            ]
                        },
                        "name": "14",
                        "inbound_nodes": [
                            [
                                [
                                    "13",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "name": "16",
                            "trainable": true,
                            "dtype": "float32",
                            "target_shape": [
                                1,
                                256,
                                256
                            ]
                        },
                        "name": "16",
                        "inbound_nodes": [
                            [
                                [
                                    "14",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "output_0",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "sigmoid"
                        },
                        "name": "output_0",
                        "inbound_nodes": [
                            [
                                [
                                    "16",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_0",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "output_0",
                        0,
                        0
                    ]
                ]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "11/kernel",
                    "shape": [
                        3,
                        3,
                        32,
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "11/bias",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "7/kernel",
                    "shape": [
                        5,
                        5,
                        1,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "7/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "9/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "9/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}
